app/views/jobs/_form.html.erb

     	     <%if params[:action] =='edit'%>
		        <%= text_field_tag 'job[email]' , @job.job_emails.first.email,:class => "form-control",:readonly => 'true',:style => "width:220px;"%>
---
SELECT `job_emails`.* FROM `job_emails` WHERE `job_emails`.`job_id` = 2 ORDER BY `job_emails`.`id` ASC LIMIT 1

	           <%= f.label 'Your category' %>
		       <label><%= f.select :category, options_for_select({ "1" => "EB 1", "2" => "EB 2" , "3" => "EB 3"}), {prompt: "Select a Category"},{class: "form-control",:style => "width:200px;"} %></label>
---
SELECT `categories`.* FROM `categories`